<a href="https://colab.research.google.com/github/Satwikram/Exploratory-data-analysis/blob/master/Black%20Friday/Black%20Friday.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Author: Satwik Ram K

## Collecting the Data

In [ ]:
!unzip /content/black_friday.zip

## Data Information

* Data
* Variable	Definition
* User_ID	User ID
* Product_ID	Product ID
* Gender	Sex of User
* Age in bins
* Occupation	Occupation (Masked)
* City_Category	Category of the City (A,B,C)
* Stay_In_Current_City_Years	Number of years stay in current city
* Marital_Status	Marital Status
* Product_Category_1	Product Category (Masked)
* Product_Category_2	Product may belongs to other category also (Masked)
* Product_Category_3	Product may belongs to other category also (Masked)
* Purchase	Purchase Amount (Target Variable)

## Importing the Dependencies

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

## Loading the Train Dataset

In [12]:
train = pd.read_csv("/content/black_friday/blackFriday_train.csv")

In [13]:
train.head(n = 10)

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN     8370
1  1000001  P00248942      F  ...                6.0                14.0    15200
2  1000001  P00087842      F  ...                NaN                 NaN     1422
3  1000001  P00085442      F  ...               14.0                 NaN     1057
4  1000002  P00285442      M  ...                NaN                 NaN     7969
5  1000003  P00193542      M  ...                2.0                 NaN    15227
6  1000004  P00184942      M  ...                8.0                17.0    19215
7  1000004  P00346142      M  ...               15.0                 NaN    15854
8  1000004   P0097242      M  ...               16.0                 NaN    15686
9  1000005  P00274942      M  ...                NaN                 NaN     7871

[10 rows x 12 columns]

In [14]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [15]:
len(train)

550068

## Loading the test Dataset

In [7]:
test = pd.read_csv("/content/black_friday/blackFriday_test.csv")

In [8]:
test.head(n = 10)

   User_ID Product_ID  ... Product_Category_2 Product_Category_3
0  1000004  P00128942  ...               11.0                NaN
1  1000009  P00113442  ...                5.0                NaN
2  1000010  P00288442  ...               14.0                NaN
3  1000010  P00145342  ...                9.0                NaN
4  1000011  P00053842  ...                5.0               12.0
5  1000013  P00350442  ...                3.0               15.0
6  1000013  P00155442  ...               11.0               15.0
7  1000013   P0094542  ...                4.0                9.0
8  1000015  P00161842  ...               13.0               16.0
9  1000022  P00067942  ...               14.0                NaN

[10 rows x 11 columns]

In [9]:
print(test.shape)

(233599, 11)

In [11]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 233599 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     233599 non-null  int64
 1   Product_ID                  233599 non-null  object
 2   Gender                      233599 non-null  object
 3   Age                         233599 non-null  object
 4   Occupation                  233599 non-null  int64
 5   City_Category               233599 non-null  object
 6   Stay_In_Current_City_Years  233599 non-null  object
 7   Marital_Status              233599 non-null  int64
 8   Product_Category_1          233599 non-null  int64
 9   Product_Category_2          161255 non-null  float64
 10  Product_Category_3          71037 non-null   float64
dtypes: float64(2), int64(4), object(5)
memory usage: 19.6+ MB

## Merging both into single Dataset

In [16]:
dataset = train.append(test, sort = False)

In [17]:
len(dataset)

783667

In [18]:
dataset.shape

(783667, 12)

In [19]:
dataset.head()

   User_ID Product_ID Gender  ... Product_Category_2  Product_Category_3 Purchase
0  1000001  P00069042      F  ...                NaN                 NaN   8370.0
1  1000001  P00248942      F  ...                6.0                14.0  15200.0
2  1000001  P00087842      F  ...                NaN                 NaN   1422.0
3  1000001  P00085442      F  ...               14.0                 NaN   1057.0
4  1000002  P00285442      M  ...                NaN                 NaN   7969.0

[5 rows x 12 columns]

In [20]:
dataset.tail()

        User_ID Product_ID  ... Product_Category_3 Purchase
233594  1006036  P00118942  ...                NaN      NaN
233595  1006036  P00254642  ...                NaN      NaN
233596  1006036  P00031842  ...               12.0      NaN
233597  1006037  P00124742  ...                NaN      NaN
233598  1006039  P00316642  ...                NaN      NaN

[5 rows x 12 columns]

## Data Description

In [21]:
dataset.describe()

            User_ID     Occupation  ...  Product_Category_3       Purchase
count  7.836670e+05  783667.000000  ...       237858.000000  550068.000000
mean   1.003029e+06       8.079300  ...           12.668605    9263.968713
std    1.727267e+03       6.522206  ...            4.125510    5023.065394
min    1.000001e+06       0.000000  ...            3.000000      12.000000
25%    1.001519e+06       2.000000  ...            9.000000    5823.000000
50%    1.003075e+06       7.000000  ...           14.000000    8047.000000
75%    1.004478e+06      14.000000  ...           16.000000   12054.000000
max    1.006040e+06      20.000000  ...           18.000000   23961.000000

[8 rows x 7 columns]

## Dropping unnecessary fields from the dataset.

In [22]:
dataset.drop('User_ID', axis = 1, inplace = True)

In [23]:
dataset.head()

  Product_ID Gender   Age  ...  Product_Category_2 Product_Category_3 Purchase
0  P00069042      F  0-17  ...                 NaN                NaN   8370.0
1  P00248942      F  0-17  ...                 6.0               14.0  15200.0
2  P00087842      F  0-17  ...                 NaN                NaN   1422.0
3  P00085442      F  0-17  ...                14.0                NaN   1057.0
4  P00285442      M   55+  ...                 NaN                NaN   7969.0

[5 rows x 11 columns]